app/controllers/api/projects_controller.rb

  def index
    @projects = Project.where user: current_user
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" IS NULL

  def show
    tasks = Task.where project: @project
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 1

    def set_api_project
      @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]