app/controllers/api/tasks_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = 9
---
  def show
    comments = Comment.where task: @task