app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "user_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "comm1"], ["user_id", 1], ["task_id", 9], ["created_at", "2018-01-14 09:47:19.929473"], ["updated_at", "2018-01-14 09:47:19.929473"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user = current_user

    if @comment.save