app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1
---
  def index
    @projects = Project.where user: current_user

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 7
---
  def show
    @tasks = Task.where project: @project

INSERT INTO "projects" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "probobr2"], ["user_id", 1], ["created_at", "2018-01-14 09:51:26.904169"], ["updated_at", "2018-01-14 09:51:26.904169"]]
---
  def create
    @project = Project.new(project_params)
    @project.user = current_user
    if @project.save