app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = 1
---
  def index
    @tasks = Task.where user: current_user

SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = 9
---
  def show
    @comments = Comment.where task: @task

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 1
---
  def new
    @task = Task.new
    @projects = Project.where user: current_user

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 2
---
  def edit
    @projects = Project.where user: current_user

INSERT INTO "tasks" ("text", "status", "project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "task1"], ["status", "t"], ["project_id", 1], ["user_id", 1], ["created_at", "2018-01-14 09:47:11.011908"], ["updated_at", "2018-01-14 09:47:11.011908"]]
---
  def create
    @task = Task.new(task_params)
    @task.user = current_user
    if @task.save