app/controllers/tasks_controller.rb

  def new
    @task = Task.new
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def edit
    @projects = Project.all
---
SELECT "projects".* FROM "projects"